import { InventoryType } from 'src/app/types/inventory-management/inventory/inventoryPage.type';

export const inventories: InventoryType[] = [
  {
    name: 'انبار محصولات اولیه',
    category: 'اولیه',
    status: 'فعال',
    users: ['حامد فاضلی', 'حسین سعادت'],
  },
  {
    name: 'انبار محصولات در حال ساخت',
    category: 'ثانویه',
    status: 'غیر فعال',
    users: ['سینا علی زاده', 'علی محمد زاده', 'مهدی هاشم پور'],
  },
  {
    name: 'انبار محصولات تولید شده',
    category: 'تولید شده',
    status: 'غیر فعال',
    users: ['محمد باقر قدوسی', 'پوریا تیموری'],
  },
  {
    name: 'انبار ضایعات',
    category: 'اولیه',
    status: 'غیر فعال',
    users: ['علی رضا رضایی', 'امین امینی', 'محمد وفایی کیا', 'عرفان دولتی'],
  },
  {
    name: 'انبار قطعات یدکی',
    category: 'ثانویه',
    status: 'فعال',
    users: ['پوریا تیموری', 'احمد قاسمی'],
  },
  {
    name: 'انبار پردازش',
    category: 'ثانویه',
    status: 'غیر فعال',
    users: ['علی رضا رضایی', 'امین امینی', 'محمد وفایی کیا', 'عرفان دولتی'],
  },
  {
    name: 'انبار توزیع',
    category: 'ثانویه',
    status: 'فعال',
    users: ['پوریا تیموری', 'احمد قاسمی'],
  },
  {
    name: 'انبار دسته بندی',
    category: 'ثانویه',
    status: 'فعال',
    users: ['سینا علی زاده', 'علی محمد زاده', 'مهدی هاشم پور'],
  },
];
export const inventoryCategories: string[] = ['اولیه', 'تولید شده', 'ثانویه'];

export const inventoryUsers: string[] = [
  'امیر الموتی',
  'امیر نظری',
  'علی نادری',
  'محمد وفایی کیا',
  'امین امینی',
  'علی رضا رضایی',
  'احمد قاسمی',
  'حسین سعادت',
  'محمد قدوسی',
  'مهدی هاشم پور',
  'حسین زیبا سرشت',
  'پوریا تیموری',
  'حامد فاضلی',
  'سینا علی زاده',
  'علی محمد زاده',
  'محمد باقر قدوسی',
  'عرفان دولتی',
];
